# ModifyConnectionRangesService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ModifyConnectionRangesService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service to view and modify structural connection ranges of applicability.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ModifyConnectionRangesService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModifyConnectionRangesService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ModifyConnectionRangesService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace